LANG_CONFIG = {
    "ru": {
        "name": "Русский",
        "code": "ru",
        "detection_threshold": 0.5,
        "MODULE_KEYWORD": "Модуль",
        "LESSONS_HEADER_KEYWORD": "### Уроки",
        "TOTAL_TIME_KEYWORD": "Общее время",
        "TIME_KEYWORD": "Время",
        "stop_words": ["и", "в", "во", "не", "что", "он", "на", "я", "с", "со", "как", "а", "то", "все", "она", "так", "его", "но", "да", "ты", "к", "у", "же", "вы", "за", "бы", "по", "только", "ее", "мне", "было", "вот", "от", "меня", "еще", "нет", "о", "из", "ему", "теперь", "когда", "даже", "ну", "вдруг", "ли", "если", "уже", "или", "ни", "быть", "был", "него", "до", "вас", "нибудь", "опять", "уж", "вам", "ведь", "там", "потом", "себя", "ничего", "ей", "может", "они", "тут", "где", "есть", "надо", "ней", "для", "мы", "тебя", "их", "чем", "была", "сам", "чтоб", "без", "будто", "чего", "раз", "тоже", "себе", "под", "будет", "ж", "тогда", "кто", "этот", "того", "потому", "этого", "какой", "совсем", "ним", "здесь", "этом", "один", "почти", "мой", "тем", "чтобы", "нее", "сейчас", "были", "куда", "зачем", "всех", "никогда", "можно", "при", "наконец", "два", "об", "другой", "хоть", "после", "над", "больше", "тот", "через", "эти", "нас", "про", "всего", "них", "какая", "много", "разве", "три", "эту", "моя", "впрочем", "хорошо", "свою", "этой", "перед", "иногда", "лучше", "чуть", "том", "нельзя", "такой", "им", "более", "всегда", "конечно", "всю", "между"],
        "common_words": ["я", "ты", "он", "она", "оно", "мы", "вы", "они", "этот", "тот", "такой", "такая", "такое", "такие", "мой", "твой", "его", "ее", "наш", "ваш", "их", "быть", "есть", "был", "была", "было", "были", "буду", "будешь", "будет", "будем", "будете", "будут"],
    }
} 