LANG_CONFIG = {
    "uk": {
        "name": "Українська",
        "code": "uk",
        "detection_threshold": 0.5,
        "MODULE_KEYWORD": "Модуль",
        "LESSONS_HEADER_KEYWORD": "### Уроки",
        "TOTAL_TIME_KEYWORD": "Загальний час",
        "TIME_KEYWORD": "Час",
        "stop_words": ["і", "в", "на", "не", "що", "він", "я", "з", "як", "а", "то", "всі", "вона", "так", "його", "але", "так", "ти", "до", "вже", "ви", "за", "був", "по", "тільки", "її", "мені", "було", "ось", "від", "мене", "ще", "ні", "про", "йому", "тепер", "коли", "навіть", "ну", "раптом", "чи", "якщо", "вже", "або", "ні", "бути", "був", "нього", "до", "вас", "будь", "знову", "вже", "вам", "адже", "там", "потім", "себе", "нічого", "їй", "може", "вони", "тут", "де", "є", "треба", "неї", "для", "ми", "тебе", "їх", "чим", "була", "сам", "щоб", "без", "ніби", "чого", "раз", "теж", "собі", "під", "буде", "ж", "тоді", "хто", "цей", "того", "тому", "цього", "який", "зовсім", "ним", "тут", "цьому", "один", "майже", "мій", "тим", "щоб", "неї", "зараз", "були", "куди", "навіщо", "всіх", "ніколи", "можна", "при", "нарешті", "два", "про", "інший", "хоч", "після", "над", "більше", "той", "через", "ці", "нас", "про", "всього", "них", "яка", "багато", "хіба", "три", "цю", "моя", "втім", "добре", "свою", "цієї", "перед", "іноді", "краще", "трохи", "том", "не можна", "такий", "їм", "більш", "завжди", "звісно", "всю", "між"],
        "common_words": ["я", "ти", "він", "вона", "воно", "ми", "ви", "вони", "цей", "той", "такий", "така", "таке", "такі", "мій", "твій", "його", "її", "наш", "ваш", "їх", "бути", "є", "був", "була", "було", "були", "буду", "будеш", "буде", "будемо", "будете", "будуть"],
    }
} 